import React from 'react'
import './style/style.css'
function Tfjs() {
  return (
    <div className="jsmain">
        <div className="jsheader">TensorflowJS</div>
        <div className="jscontents">
            <h2>What is TensorflowJS?</h2>
            <p>เทนเซอร์โฟล์ว JS คือ เฟรมเวอร์คสำหรับMachine learning ที่พัฒนาแบบopen source ของบริษัทGoogle ที่วางบนรากฐาน Keras และแจมๆกับ pytorch เล็กน้อย มันเป็นการทำMacvine learning ในรูปแบบ WebGL ถ้าหากคุรทำเว็บไซต์เป็นจะทำให้คุณใช้ TFJS ได้ง่ายขึ้น เพราะมันรันระบบในรูปแบบเว็บไซต์</p>
            <h3>แนวคิด</h3>
            <p>อย่างแน่นอนว่าmachine learning มันมีแนวคิดมาจาก Neural Network หรือการจำลองการทำงานของสมองมนุษย์ ในการตัดสินใจและเข้าใจสิ่งต่างๆ</p>
            <h3>Big data</h3>
            <p>แน่นอนว่า ข้อมูลขนาดใหญ่จะทำให้ โมเดล machine learning ของเรานั้น แม่นยำและมีประสิทธิภาพ ยิ่งขึ้น เพราะมันเรียนรู้จากข้อมูลที่เราป้อนเข้าไป และประสิทธิภาพอาจขึ้นอยู่กับความแรงของเครื่องด้วย ถ้าเครื่องดี ข้อมูลเยอะ อาจทำงานยากๆให้ง่ายได้ เช่น วินิจฉัยโรคผู้ป่วยได้ หลายล้านรายการต่อวัน ซึ่งส่งผลดีทำให้คน ไม่ต้องรอผลวินิจฉัยโรคนาน และเข้าถึงบริการด้านสุขภาพได้อย่างรวดเร็ว แม่นยำ และมีประสิทธิภาพสูง</p>
            <h3>TFJS + IOT</h3>
            <p>เทนเซอร์โฟล์วนั้น มีเวอร์ชั่นLite ที่สามารถเทรนโมเดล มารันบนบอร์ดที่มีความจุประมาณหนึ่งได้ ใช้แล้วครับ ผมหมายถึง raspberryPi นั่นเอง อาจเห็นโปรเจอพวกนี้อยู่รอบตัวเรา เช่น การแสกนแมสก์ช่วงโควิด19 ก่อนที่จะสามารถผ่านประตูได้ หรือแม้แต่โปรเจคใหญ่มหาศาลอย่าง รถยนต์ไร้คนขับ ที่เทรนโมเดล ใส่รถยนต์ แต่ในกรณีนี้ผมไม่ได้หมายความว่าTesla ใช้RaspberryPi นะ ผมก็ไม่แน่ใจเหมือนกันว่าใช้ตัวไหน เพราะTesla ใช้ชิปประมวลผลที่ผลิตขึ้นมาเอง และอาจมีชิบมาจากTSMC หรือ ระบบประมวลผลของAMD(อันนี้ไม่แน่ใจ) และมี Dojo Super Computer </p>
            <h3>NodeJS</h3>
            <p>อย่างแน่นอนว่า NodeJS คือ Javascript run time ยอดฮิต สำหรับ </p>
            <h3>ติดตามข่าวสาร</h3>
            <p>Website : www.tensorflow.org <br/>Twitter : Tensorflow <br />YouTube : Tensorflow <br /> deverloper Twitter : Jason Mayes</p>
        </div>
    </div>
  )
}

export default Tfjs